CSI API ETABS v1

# cAnalysisResultsSetupGetOptionMultiStepStatic Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetOptionMultiStepStatic(
    	ref int Value
    )

    Function GetOptionMultiStepStatic (
    	ByRef Value As Integer
    ) As Integer

    Dim instance As cAnalysisResultsSetup
    Dim Value As Integer
    Dim returnValue As Integer

    returnValue = instance.GetOptionMultiStepStatic(Value)

    int GetOptionMultiStepStatic(
    	int% Value
    )

    abstract GetOptionMultiStepStatic :
            Value : int byref -> int

#### Parameters

Value

    Type: SystemInt32

#### Return Value

Type: Int32

See Also

#### Reference

cAnalysisResultsSetup Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com